<?php

class m140624_081237_districts_cities_tbl extends CDbMigration
{
    protected $MySqlOptions = 'ENGINE=InnoDB CHARSET=utf8';

	public function safeUp()
	{
        $this->createTable('districts', array(
            'district_id' => 'pk',
            'country_id' => 'int(11) NOT NULL',
            'name' => 'varchar(255) NOT NULL',
        ), $this->MySqlOptions);

        $this->createTable('cities', array(
            'city_id' => 'pk',
            'district_id' => 'int(11) NOT NULL',
            'name' => 'varchar(255) NOT NULL',
        ), $this->MySqlOptions);

        $this->dropColumn('locations', 'description');
        $this->addColumn('locations', 'place_id','int(11) not null');

        # add districts
        $districtsStr = 'Vinnytsia Oblast;Volyn Oblast;Dnipropetrovsk Oblast;Donetsk Oblast;Zhytomyr Oblast;Zakarpattia Oblast;Zaporizhia Oblast;Ivano-Frankivsk Oblast;Kiev Oblast;Kirovohrad Oblast;Luhansk Oblast;Lviv Oblast;Mykolaiv Oblast;Odessa Oblast;Poltava Oblast;Rivne Oblast;Sumy Oblast;Ternopil Oblast;Kharkiv Oblast;Kherson Oblast;Khmelnytskyi Oblast;Cherkasy Oblast;Chernivtsi Oblast;Chernihiv Oblast;Autonomous Republic of Crimea';
        $districtsArr = explode(';',$districtsStr);

        foreach($districtsArr as $district)
        {
            $this->insert('districts', array(
                'name'=>$district,
                'country_id'=>'1',
            ));
        }


        # add cities
        $cities = array(
            "Авдеевка"=>4,
            "Александрия(Кировоградская область)|Александрия"=>10,
            "Александровск(Луганская область)|Александровск"=>11,
            "Алмазная"=>11,
            "Алчевск"=>11,
            "Ананьев(Одесская область)|Ананьев"=>14,
            "Андрушёвка"=>5,
            "Антрацит(Луганская область)|Антрацит"=>11,
            "Апостолово"=>3,
            "Артёмовск(Донецкая область)|Артёмовск"=>4,
            "Артёмовск(Луганская область)|Артёмовск"=>11,
            "Арциз"=>14,"Ахтырка"=>17,
            "Балаклея"=>19,
            "Балта"=>14,"Бар"=>1,"Барановка(город)|Барановка"=>5,"Барвенково"=>19,"Бахмач"=>23,"Баштанка"=>13,"БелаяЦерковь"=>9,"Белгород-Днестровский"=>14,"Белополье"=>17,"Белз"=>12,"Бердичев"=>5,"Бердянск"=>7,"Берегово"=>6,"Бережаны"=>18,"Березань"=>9,"Березне"=>16,"Берестечко"=>2,"Берислав"=>20,"Бершадь"=>1,"Бобринец"=>10,"Бобрка"=>12,"Бобровица"=>23,"Богодухов"=>19,"Богуслав(Киевскаяобласть)|Богуслав"=>9,"Болград"=>14,"Болехов"=>8,"Борислав(город)|Борислав"=>12,"Борисполь"=>9,"Борзна"=>23,"Борщёв"=>18,"Боярка"=>9,"Бровары"=>9,"Броды"=>12,"Брянка"=>11,"Бурынь"=>17,"Бурштын"=>8,"Буск"=>12,"Буча"=>9,"Бучач"=>18,"Валки(Харьковскаяобласть)|Валки"=>19,"Васильевка(ВасильевскийрайонЗапорожскойобласти)|Васильевка"=>7,"Васильков"=>9,"Вашковцы"=>24,"Ватутино"=>22,"Вахрушево(город)|Вахрушево"=>11,"ВеликийБурлук(посёлок)|ВеликийБурлук"=>19,"ВеликиеМосты"=>12,"Верхнеднепровск"=>3,"Вольнянск"=>7,"Винница"=>1,"Виноградов(город)|Виноградов"=>6,"Вишнёвое"=>9,"Владимир-Волынский"=>2,"Вознесенск"=>13,"Волноваха"=>4,"Волчанск(Харьковскаяобласть)|Волчанск"=>19,"Волочиск"=>21,"Вольногорск"=>3,"Вижница"=>24,"Вышгород(Киевскаяобласть)|Вышгород"=>9,"Гадяч"=>15,"Гайсин"=>1,"Гайворон"=>10,"Галич(Ивано-Франковскаяобласть)|Галич"=>8,"Геническ"=>20,"Герца"=>24,"Глобино"=>15,"Глухов(Сумскаяобласть)|Глухов"=>17,"Глиняны"=>12,"ГолаяПристань"=>20,"Горловка"=>4,"Горное"=>11,"Городенка"=>8,"Городище(Черкасскаяобласть)|Городище"=>22,"Городня"=>23,"Городок(Львовскаяобласть)|Городок"=>12,"Городок(Хмельницкаяобласть)|Городок"=>21,"Горохов(город)|Горохов"=>2,"Гребёнка(Полтавскаяобласть)|Гребёнка"=>15,"Гуляйполе"=>7,"Дзержинск"=>4,"Дебальцево"=>4,"Деражня"=>21,"Дергачи(город)|Дергачи"=>19,"Десна(Черниговскаяобласть)|Десна"=>23,"Димитров(город)|Димитров"=>4,"Днепродзержинск"=>3,"Днепропетровск"=>3,"Днепрорудное"=>7,"Добромиль"=>12,"Доброполье"=>4,"Докучаевск"=>4,"Долина(город)|Долина"=>8,"Долинская"=>10,"Донецк(Украина)|Донецк"=>4,"Дрогобыч"=>12,"Дружковка"=>4,"Дубно"=>16,"Дубляны(ЖолковскийрайонЛьвовскойобласти)|Дубляны"=>12,"Дубровица"=>16,"Дунаевцы(город)|Дунаевцы"=>21,"Енакиево"=>4,"Жашков"=>22,"Ждановка(город)|Ждановка"=>4,"ЖёлтыеВоды"=>3,"Жидачов"=>12,"Житомир"=>5,"Жмеринка"=>1,"Жолква"=>12,"Залещики"=>18,"Запорожье"=>7,"Заставна"=>24,"Збараж"=>18,"Зборов"=>18,"Звенигородка"=>22,"Здолбунов"=>16,"Зимогорье"=>11,"Зеньков"=>15,"Змиев"=>19,"Знаменка(город)|Знаменка"=>10,"Золотое"=>11,"Золотоноша"=>22,"Золочев(Львовскаяобласть)|Золочев"=>12,"Зоринск"=>11,"Зугрэс"=>4,"Ивано-Франковск"=>8,"Измаил"=>14,"Изюм(город)|Изюм"=>19,"Изяслав(город)|Изяслав"=>21,"Ильичёвск"=>14,"Ирпень"=>9,"Иршава"=>6,"Ичня"=>23,"Кагарлык"=>9,"Казатин"=>1,"Калиновка(КалиновскийрайонВинницкойобласти)|Калиновка"=>1,"Калуш"=>8,"Каменец-Подольский"=>21,"Каменка(Черкасскаяобласть)|Каменка"=>22,"Каменка-Бугская"=>12,"Каменка-Днепровская"=>7,"Камень-Каширский"=>2,"Канев"=>22,"Карловка"=>15,"Каховка"=>20,"Киверцы"=>2,"Киев"=>9,"Килия"=>14,"Кировоград"=>10,"Кировское"=>4,"Кицмань"=>24,"Краматорск"=>4,"Красилов"=>21,"Красноармейск(Донецкаяобласть)|Красноармейск"=>4,"Красноград"=>19,"Краснодон(город)|Краснодон"=>11,"Краснопартизанск"=>11,"КрасныйЛиман"=>4,"КрасныйЛуч(город)|КрасныйЛуч"=>11,"Кременец"=>18,"Кременчуг"=>15,"КривойРог"=>3,"Кролевец"=>17,"Кобеляки"=>15,"Ковель"=>2,"Кодыма(город)|Кодыма"=>14,"Коломыя"=>8,"Комсомольск(Полтавскаяобласть)|Комсомольск"=>15,"Конотоп"=>17,"Константиновка(город)|Константиновка"=>4,"Корец"=>16,"Коростень"=>5,"Коростышев"=>5,"Корсунь-Шевченковский"=>22,"Корюковка"=>23,"Косов"=>8,"Костополь"=>16,"Котовск(Одесскаяобласть)|Котовск"=>14,"Кузнецовск"=>16,"Купянск"=>19,"Ладыжин"=>1,"Лановцы"=>18,"Лебедин"=>17,"Лисичанск"=>11,"Лозовая"=>19,"Лохвица"=>15,"Лубны"=>15,"Луганск"=>11,"Лутугино"=>11,"Луцк"=>2,"Львов"=>12,"Любомль"=>2,"Люботин"=>19,"Малин(Житомирскаяобласть)|Малин"=>5,"Марганец(город)|Марганец"=>3,"Мариуполь"=>4,"Макеевка"=>4,"МалаяВиска"=>10,"Мелитополь"=>7,"Мена(Украина)|Мена"=>23,"Мерефа"=>19,"Миргород"=>15,"Мироновка"=>9,"Миусинск"=>11,"Могилёв-Подольский"=>1,"Молодогвардейск"=>11,"Молочанск"=>7,"Монастыриска"=>18,"Монастырище"=>22,"Мостиска"=>12,"Мукачево"=>6,"Николаев(Львовскаяобласть)|Николаев"=>12,"Николаев(Николаевскаяобласть)|Николаев"=>13,"Никополь(Днепропетровскаяобласть)|Никополь"=>3,"Нежин"=>23,"Немиров(Винницкаяобласть)|Немиров"=>1,"Нетешин"=>21,"НоваяКаховка"=>20,"НоваяОдесса"=>13,"НовыйБуг"=>13,"Нововолынск"=>2,"Новгород-Северский"=>23,"Новогродовка"=>4,"Новомиргород"=>10,"Новоград-Волынский"=>5,"Новодружеск"=>11,"Новоднестровск"=>24,"Новомосковск(Днепропетровскаяобласть)|Новомосковск"=>3,"Новопсков"=>11,"Новоселица"=>24,"Новоукраинка"=>10,"Носовка"=>23,"Майорск"=>4,"Обухов(город)|Обухов"=>9,"Овруч"=>5,"Одесса"=>14,"Орджоникидзе(город,Днепропетровскаяобласть)|Орджоникидзе"=>3,"Орехов(город)|Орехов"=>7,"Острог(Ровенскаяобласть)|Острог"=>16,"Очаков"=>13,"НовыйРоздол"=>12,"Павлоград"=>3,"Первомайск(город,Луганскаяобласть)|Первомайск"=>11,"Первомайск(Николаевскаяобласть)|Первомайск"=>13,"Первомайский(Харьковскаяобласть)|Первомайский"=>19,"Перевальск"=>11,"Перемышляны"=>12,"Перечин"=>6,"Перещепино"=>3,"Переяслав-Хмельницкий"=>9,"Першотравенск(Днепропетровскаяобласть)|Першотравенск"=>3,"Петровское(Луганскаяобласть)|Петровское"=>11,"Пирятин"=>15,"Погребище"=>1,"Подволочиск"=>18,"Подгайцы"=>18,"Подгородное"=>3,"Пологи"=>7,"Полонное"=>21,"Полтава"=>15,"Попасная"=>11,"Почаев"=>18,"Приволье"=>11,"Прилуки"=>23,"Приморск"=>7,"Припять(город)|Припять"=>9,"Пустомыты"=>12,"Путивль"=>17,"Пятихатки(город)|Пятихатки"=>3,"Рава-Русская"=>12,"Радехов"=>12,"Радомышль"=>5,"Радивилов"=>16,"Рахов"=>6,"Ржищев"=>9,"Рогатин"=>8,"Ровеньки(город)|Ровеньки"=>11,"Ровно"=>16,"Рожище"=>2,"Ромны"=>17,"Рубежное"=>11,"Рудки"=>12,"Самбор"=>12,"Сарны"=>16,"Свалява"=>6,"Сватово"=>11,"Свердловск(Луганскаяобласть)|Свердловск"=>11,"Светловодск"=>10,"Северодонецк"=>11,"Седнев"=>23,"Селидово"=>4,"Семёновка(город)|Семёновка"=>23,"Середина-Буда"=>17,"Синельниково"=>3,"Скадовск"=>20,"Скалат"=>18,"Сквира"=>9,"Сколе"=>12,"Славута"=>21,"Славутич(город)|Славутич"=>9,"Славянск"=>4,"Смела"=>22,"Снежное"=>4,"Снигирёвка"=>13,"Снятын"=>8,"Сокаль"=>12,"Сокиряны"=>24,"Соледар"=>4,"Старобельск"=>11,"Староконстантинов"=>21,"СтарыйСамбор"=>12,"Стаханов(город)|Стаханов"=>11,"Сторожинец"=>24,"Стрый(город)|Стрый"=>12,"Сумы"=>17,"Суходольск"=>11,"Счастье(Луганскаяобласть)|Счастье"=>11,"Таврийск"=>20,"Тальное"=>22,"Тараща"=>9,"Татарбунары"=>14,"Теплогорск"=>11,"Теплодар"=>14,"Тернополь"=>18,"Терновка(город)|Терновка"=>3,"Тетиев"=>9,"Тысменица(город)|Тысменица"=>8,"Тлумач"=>8,"Теребовля"=>18,"Тростянец(Сумскаяобласть)|Тростянец"=>17,"Трускавец"=>12,"Токмак(Украина)|Токмак"=>7,"Торез(город)|Торез"=>4,"Тульчин"=>1,"Тячев"=>6,"Угледар"=>4,"Угнев"=>12,"Узин"=>9,"Украинка(город)|Украинка"=>9,"Ужгород"=>6,"Умань"=>22,"Устилуг"=>2,"Фастов"=>9,"Харцызск"=>4,"Харьков"=>19,"Херсон"=>20,"Хмельник"=>1,"Хмельницкий(город)|Хмельницкий"=>21,"Хорол"=>15,"Хотин"=>24,"Христиновка"=>22,"Хуст"=>6,"Хыров"=>12,"Цюрупинск"=>20,"Червоноград"=>12,"Червонозаводское"=>15,"Черкассы"=>22,"Чернигов"=>23,"Чернобыль"=>9,"Черновцы"=>24,"Чигирин"=>22,"Чоп"=>6,"Чортков"=>18,"Чугуев"=>19,"Шаргород"=>1,"Шахтёрск(Донецкаяобласть)|Шахтёрск"=>4,"Шепетовка"=>21,"Шостка"=>17,"Шпола"=>22,"Шумск"=>18,"Щорс"=>23,"Энергодар"=>7,"Южное(город)|Южное"=>14,"Южноукраинск"=>13,"Яворов"=>12,"Яготин"=>9,"Ямполь(Винницкаяобласть)|Ямполь"=>1,"Яремче"=>8,"Ясиноватая"=>4,
            "Симферополь"=>25,
            "Армянск"=>25,
            "Джанкой"=>25,
            "Евпатория"=>25,
            "Зелёный Яр"=>25,
            "Керчь"=>25,
            "Красноперекопск"=>25,
            "Красносельское"=>25,
            "Новосельское"=>25,
            "Партенит"=>25,
            "Плодовое"=>25,
            "Феодосия"=>25,
            "Щёлкино"=>25,
            "Ялта"=>25
        );

        foreach($cities as $name=>$id)
        {
            $this->insert("cities", array(
                "name"=>$name,
                "district_id"=>$id,
            ));
        }


        # update levels

        $command = Yii::app()->db->createCommand('SELECT district_id FROM districts');
        $districtsArr = $command->queryAll();

        foreach($districtsArr as $district)
        {
            $this->insert("locations", array(
                "level_id"=>2,
                "place_id"=>$district['district_id'],
                "date_added"=>new CDbExpression('NOW()')
            ));
        }

        $command = Yii::app()->db->createCommand('SELECT city_id FROM cities');
        $cities = $command->queryAll();

        foreach($cities as $city)
        {
            $this->insert("locations", array(
                "level_id"=>3,
                "place_id"=>$city['city_id'],
                "date_added"=>new CDbExpression('NOW()')
            ));
        }


	}

	public function safeDown()
	{
		echo "m140624_081237_districts_cities_tbl does not support migration down.\\n";
		return false;
	}
}